<!-- dflook/terraform-github-actions {"workspace":"destroy","backend_type":"remote","plan_modifier":"051a6df03c1b94ddb53b9a5329a560edecfe2c5bcd6a6a36ac0b75d175265fcb","backend":"cff8ba77e0d926001b9b3a26e31cf61780cd22012b248c2631abf4b4020ed0e1","plan_job_ref":"Job Test plan target and replace #323 at https://github.com/dflook/terraform-github-actions/actions/runs/4295435982","plan_hash":"a3d6d16c3665342a1f5acdc685bcfc62d358a75776552599561c3a5bbffc59dc","plan_text_format":"text","version":"99.0.0"} -->
Terraform plan in __tests/workflows/test-target-replace__ in the __destroy__ workspace
Replacing resources: `random_string.foreach["hello"]`, `random_string.count[0]`
With variables: `length = 10`
<details>
<summary>Plan: 2 to add, 0 to change, 2 to destroy. Changes to Outputs.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # random_string.count[0] will be replaced, as requested
-/+ resource "random_string" "count" {
      ~ id          = "**********" -> (known after apply)
      ~ result      = "**********" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # random_string.foreach["hello"] will be replaced, as requested
-/+ resource "random_string" "foreach" {
      ~ id          = "**********" -> (known after apply)
      ~ result      = "**********" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

Plan: 2 to add, 0 to change, 2 to destroy.

Changes to Outputs:
  ~ count   = "aoXllvMExu" -> (known after apply)
  ~ foreach = "j64QlEPD9u" -> (known after apply)
```
</details>

:memo: Plan generated in [Test plan target and replace #323](https://github.com/dflook/terraform-github-actions/actions/runs/4295435982)